# задание 1

In [2]:
import pandas as pd

In [6]:
movies = pd.read_csv('movies.csv')
tags = pd.read_csv('tags.csv')
rating = pd.read_csv('ratings.csv')
links = pd.read_csv('links.csv')
power = pd.read_csv('power.csv')

In [9]:
rating.head()

   userId  movieId  rating  timestamp
0       1        1     4.0  964982703
1       1        3     4.0  964981247
2       1        6     4.0  964982224
3       1       47     5.0  964983815
4       1       50     5.0  964982931

In [61]:
rating_s = rating.filter(items = ['movieId', 'rating'])
# rating_s.head()

In [48]:
a = rating_s[rating_s['rating']==5.0].value_counts().agg(max)
print(a) #не понятно как вывести фильм вместо значения


# rating_s[rating_s['rating']==5.0].value_counts().head()

153

In [64]:
rating_s['NEW'] = rating_s[rating_s['rating']==5.0].sort_values('rating', ascending= False).value_counts().agg(max)
rating_s.head()

   movieId  rating  NEW
0        1     4.0  153
1        3     4.0  153
2        6     4.0  153
3       47     5.0  153
4       50     5.0  153

# задание2

In [ ]:
# посчитайте суммарное потребление стран (Латвия, Литва и Эстония)категорий 4, 12 и 21 за период с 2005 по 2010 года. 
# Не учитывайте в расчетах отрицательные значения quantity.

In [63]:
power.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [42]:

cleared = power[ (power.year.between(2005,2010, inclusive=True)) & (power.category.isin([4,12,21])) ]

latv = cleared[ cleared.country.str.contains('latvia', case = False) & (cleared.quantity >0)  ].sum()
# latvi = latv.filter(items = ['quantity'])

lith = cleared[ cleared.country.str.contains('Lithuania', case = False) & (cleared.quantity >0)  ].sum()
# lithu = lith.filter(items = ['quantity'])

esto = cleared[ cleared.country.str.contains('Estonia', case = False) & (cleared.quantity >0)  ].sum()
# eston = esto.filter(items = ['quantity'])

# su = latv + lithu + eston
su = latv + lith + esto
su.filter(items = ['quantity'])

quantity    240580.0
dtype: object

# Задание 3

In [59]:
pd.read_html('https://fortrader.org/quotes')[2]

                           Название   Цена  Изменение  Изменение(%)  Обновлено
0       Золото Цена золота на бирже  1 812       -1.0         -0.00        NaN
1  Серебро Цена на серебро на бирже  25.65       -0.0         -0.00        NaN
2         Палладий Цена на Палладий  2 624       -7.0         -0.00        NaN
3           Платина Цены на платину  1 100       -0.0         -0.00        NaN
4           Медь Цена меди на бирже   4.31       -0.0         -0.01        NaN

In [65]:
readhtml = 'https://fortrader.org/quotes'

df = pd.read_html(readhtml)
df[2]

                           Название   Цена  Изменение  Изменение(%)  Обновлено
0       Золото Цена золота на бирже  1 812       -1.0         -0.00        NaN
1  Серебро Цена на серебро на бирже  25.65       -0.0         -0.00        NaN
2         Палладий Цена на Палладий  2 624       -7.0         -0.00        NaN
3           Платина Цены на платину  1 100       -0.0         -0.00        NaN
4           Медь Цена меди на бирже   4.31       -0.0         -0.01        NaN